Revit 2027 API
ElectricalSystem.GroundConductorsNumber Property
 The GroundConductors Number of the Electrical System.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GroundConductorsNumber { get; }
Public ReadOnly Property GroundConductorsNumber As Integer
	Get
public:
property int GroundConductorsNumber {
	int get ();
}
member GroundConductorsNumber : int with get
Property Value
Int32
Exceptions
Exception | Condition
InvalidOperationException |  This property only available when System Type is Power!
Remarks
 This property is used to retrieve the GroundConductors Number of the Electrical System.
See Also
Reference
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace